app/controllers/api/v1/ingredients_controller.rb

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 3]]
---
	def index
		sandwich = Sandwich.find_by(id: params[:sandwich_id])