app/controllers/sandwich_views_controller.rb

  def index
    @sandwiches = Sandwich.all
---
SELECT "sandwiches".* FROM "sandwiches"

  def show
    @sandwich = Sandwich.find(params[:id])
    @ingredients = Ingredient.all
    @total_calories=@sandwich.ingredients.sum{|i| i.calories}
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT "ingredients".* FROM "ingredients"
SELECT "ingredients".* FROM "ingredients" INNER JOIN "sandwich_ingredients" ON "ingredients"."id" = "sandwich_ingredients"."ingredient_id" WHERE "sandwich_ingredients"."sandwich_id" = ?  [["sandwich_id", 3]]